---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointNameParam
source: html/c3966410-e42a-b5a1-ace1-cb7c25cbdd30.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointNameParam Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId PointNameParam { get; }
```